lab-grid-gen/motorBike/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# copy motorbike surface from resources directory
cp $FOAM_TUTORIALS/resources/geometry/motorBike.obj.gz constant/triSurface/
runApplication surfaceFeatureExtract

runApplication blockMesh

runApplication decomposePar
runParallel snappyHexMesh 4

#- For non-parallel running
#cp -r 0.org 0 > /dev/null 2>&1

#- For parallel running
#ls -d processor* | xargs -I {} rm -rf ./{}/0
#ls -d processor* | xargs -I {} cp -r 0.org ./{}/0

#runParallel patchSummary 6
#runParallel potentialFoam 6
#runParallel $(getApplication) 6

#runApplication reconstructParMesh -constant
#runApplication reconstructPar -latestTime

# ----------------------------------------------------------------- end-of-file
